//#include "stdafx.h"
#include <stdio.h>

/********************************************************************
 * ch2,p55, 3.假设m是一个已知3位数，从左到右用a,b,c表示各位数字，
 *          则由数abc如何求数bac，写出表达式。
 * 答：由数abc(用m表示)，求出: a=m/100,b=m/10%10,c=m%10。
 *     表达式：bac = b*100 + a*10 + c; 
 * while(1)不做要求 
 ********************************************************************/
void ch2_3()
{
	printf("============ch2_3()\n");
	printf("please input 3bit number abc,eg. 123,input 0,exit\n");
	int a,b,c,m,bac;
	while (1) 
	{
		scanf("%d",&m);
		if (m==0) break;
		a=m/100;
		b=(m-a*100)/10;
		//b=(m/10)%10;   // ok
		//b=(m%100)/10;  // ok
		//b=m/10%10;     // ok,"/"和"%"运算符优先级同（3），结合方向：自左向右，因此可以不加括号
		//b=m%100/10;    // ok,"/"和"%"运算符优先级同（3），结合方向：自左向右，因此可以不加括号
		c= m%10;
		printf("bac=%d%d%d\n",b,a,c);
		// 或 
		bac=b*100+a*10+c;
		printf("bac=%03d\n",bac); // 注意格式%03d, 不够三位左端用零填充，例如，输入100，显示001 
	}
}

/*************************************************************
  ch2,p55,5.写出一个表达式，如果变量C是大写字母，则将C转换为小写字母，否则C的值不变。
  答：表达式：C = 'A'<=C && C<='Z'?C+32:C 
  while(1)不做要求 
**************************************************************/
void ch2_5()
{
    printf("============ch2_5()\n");
	char C;
	while(1) {
	   printf("请键入任意一个字母，如果是大写将变为小写。输入0，结束。\n");
       //scanf("%c", &C);  // 注意，scanf(),getchar()要等待回车才接收字符，导致下一个循环读取一个'\n',而不是新输入的字符。 
       //C=getchar();
       C=getche();
       if (C=='0') break;
       C = 'A'<=C && C<='Z'?C+32:C;
       printf("\n转换后的字母：%c\n",C);
	   //printf("\n转换后的字母：%c\n",'A'<=C && C<='Z'?C+32:C); //ok
    }
}


void ch2()
{
	printf("==========ch2()\n");
	
	ch2_3();
	ch2_5();
}
