//#include <stdafx.h>
#include <stdio.h>
#include <conio.h>
#include <math.h>


//ch3,p71, 1. 编程实现：输入圆的半径，输出其周长和面积
void ch3_1()
{
	float r, Pi=3.14;
	printf("请输入圆的半径：\n");
	scanf("%f", &r);
	printf("周长为%.2f,面积为%.2f\n", 2 * r * Pi, Pi * r * r);
}

/*********************
 * ch3, p71, 2.写出利用函数getche()和putchar()进行字符串的输入/输出，并对字符的个数进行累加并输出结果的程序。
 * 注，第五章后再做此题。 使用不回显的getch()获取字符。 
 * 参考ch5. p91例题 
 *********************/
void ch3_2()
{
     printf("======ch3_2()\n");
     printf("假定输入回车符为止。\n");
     char ch; int len=0;
     puts("Type in a sentence,then press <Enter>\n");
     while((ch=getch())!= '\r') {
        putchar(ch);
        len++;                  
     } 
     printf("\nlen=%d\n",len);
}

/******************************************** 
 ch3,p71,3.已知鸡兔共有头a个，有脚b只，计算鸡兔各多少只？
           鸡兔脚的总数b可以任意输入吗？
 答：鸡x,兔y, x+y=a，2x+4y=b;  x= 2a-b/2, y=b/2-a;
     b必须是2的整数倍 
 ********************************************/ 
void ch3_3()
{
	int a, b, x, y;
	printf("输入头和脚的个数，空格隔开。\n");
	scanf("%d%d", &a,&b);
	//b必须是2的整数倍
    if (b%2!=0) {
      printf("脚必须是2的整数倍！");
      return;            
	} 
	x = 2*a-b/2;
	y = b/2-a;
	printf("有%d只鸡,%d只兔子\n", x,y);
}

/******************************************** 
 ch3,p71,4.编程从键盘输入一个3位数，将它们逆序输出。
           例如输入123，则输出321。通过后续章节的学习，将能解决任意多位数字的逆序输出。
 第一种解法，同ch2,第3题. 由数abc(用m表示)，求a=m/100,b=m/10%10,c=m%10，则输出cba = c*100+b*10+a; 
 第二种解法，在学习循环语句后，循环求取个位数（m%10,m=m/10），实现任意多位数字的逆序输出。
 第三种解法，函数的递归调用 
 ********************************************/
 void ch3_4_1()
 {
	printf("============ch3_4()_1\n");
	printf("第一种解法，同ch2,第3题。逆序输出数字。\n"); 
	printf("please input 3bit number abc,eg. 123,input 0,exit\n");
	int a,b,c,m,cba;
	while (1) 
	{
		scanf("%d",&m);
		if (m==0) break;
		a=m/100;
		b=(m-a*100)/10;
		//b=(m/10)%10;   // ok
		//b=(m%100)/10;  // ok
		//b=m/10%10;     // ok,"/"和"%"运算符优先级同（3），结合方向：自左向右，因此可以不加括号
		//b=m%100/10;    // ok,"/"和"%"运算符优先级同（3），结合方向：自左向右，因此可以不加括号
		c= m%10;
		printf("cba=%d%d%d\n",c,b,a);
		// 或 
		cba=c*100+b*10+a;
		printf("cba=%03d\n",cba);  // 注意格式%03d, 不够三位左端用零填充，例如，输入100，显示001 
	}
      
 } 
 
 /******************************************** 
 ch3,p71,4.编程从键盘输入一个3位数，将它们逆序输出。
           例如输入123，则输出321。通过后续章节的学习，将能解决任意多位数字的逆序输出。
 第一种解法，同ch2,第3题. 由数abc(用m表示)，求a=m/100,b=m/10%10,c=m%10，则输出cba = c*100+b*10+a; 
 第二种解法，在学习循环语句后，循环求取个位数（m%10,m=m/10），实现任意多位数字的逆序输出。
 第三种解法，函数的递归调用  
 ********************************************/
 void ch3_4_2()
 {
	printf("============ch3_4_2()\n");
	printf("第二种解法，循环求取个位数。\n"); 
	printf("输入多位数，逆序输出，输入0,退出\n");
	int m;
	while (1) 
	{
		scanf("%d",&m);
		if (m==0) break;
		while(1) {
          putchar(m%10 + '0');  // 字符数字的ascii码(整数) = 数字 + '0' ，如 '1' = 1 + '0' = 49 
          if (m >= 0 && m <=9) break; // 如果是一位数了，终止循环 
          m /= 10;  
        } 
        putchar('\n'); 
	}    
 }
 
 // 递归调用，实现m的逆序输出 
 void ch3_4_3_3(int m)
 {    
    putchar(m%10+'0'); // 字符数字的ascii码(整数) = 数字 + '0' ，如 '1'的ascii = 1 + '0' = 49
    if (m >= 0 && m <=9) return; // 如果是一位数了，终止递归 
    else ch3_4_3_3(m/10);   
 } 
 
  /******************************************** 
 ch3,p71,4.编程从键盘输入一个3位数，将它们逆序输出。
           例如输入123，则输出321。通过后续章节的学习，将能解决任意多位数字的逆序输出。
 第一种解法，同ch2,第3题. 由数abc(用m表示)，求a=m/100,b=m/10%10,c=m%10，则输出cba = c*100+b*10+a; 
 第二种解法，在学习循环语句后，循环求取个位数（m%10,m=m/10），实现任意多位数字的逆序输出。 
 第三种解法，函数的递归调用 
 ********************************************/
 void ch3_4_3()
 {
	printf("============ch3_4_3()\n");
	printf("第三种解法，函数的递归调用。\n"); 
	printf("输入多位数，逆序输出，输入0,退出\n");
	int m;
	while (1) 
	{
		scanf("%d",&m);
		if (m==0) break;
		ch3_4_3_3(m);
        putchar('\n'); 
	}    
 }
 
 /******************************************** 
 ch3,p71,4.编程从键盘输入一个3位数，将它们逆序输出。
           例如输入123，则输出321。通过后续章节的学习，将能解决任意多位数字的逆序输出。
 第一种解法，同ch2,第3题. 由数abc(用m表示)，求a=m/100,b=m/10%10,c=m%10，则输出cba = c*100+b*10+a; 
 第二种解法，在学习循环语句后，循环求取个位数（m%10,m=m/10），实现任意多位数字的逆序输出。
 第三种解法，函数的递归调用。
 ********************************************/
 void ch3_4()
 {
      ch3_4_1(); // 解法一 
      ch3_4_2(); // 解法二 
      ch3_4_3(); // 解法三
 } 
 
/**********************************
 * ch3, p71, 5. 编程从键盘输入一个三角形的三条边a、b、c，求三角形面积 。
 *     s=0.5(a+b+c),area=sqrt(s*(s-a)*(s-b)*(s-c)).
 *     三角形的三条边长可任意输入吗？ 【两边之和大于第三边，差小于第三边。】 
 * 注：条件语句在学习ch4后，再补充。 
 **********************************/
void ch3_5()
{
	printf("======ch3_5()\n");
    float a,b,c,s,area;

	printf("请输入a,b,c,用逗号隔开3个数\n");
	scanf("%f,%f,%f",&a,&b,&c);  // 输入必须用逗号隔开。如3,4,5
	//scanf("%f,%f,%f\n",&a,&b,&c);  // 输入必须用逗号隔开。两次回车接收输入,如3,4,5回车 3,4,5回车
    //scanf("%f%f%f",&a,&b,&c);    // 输入必须用空格隔开。推荐使用,如3 4 5

	//s =1/2*(a+b+c);  // error, s=0
	//s =1.0/2*(a+b+c);  // ok, 整数相除，自动截断；实型常量，不要忘了'.'
	//s =1/2.0*(a+b+c);  // ok
	//s =1.0/2.0*(a+b+c);  // ok

	// 两边之和大于第三边，差小于第三边
	// Calculate the absolute value
	// int abs(int n)
	// double fabs(double x)
	if(a+b<=c || fabs(a-b)>=c || a+c<=b || fabs(a-c)>=b || b+c<=a || fabs(b-c)>=a) 
    {
		printf("不能构成三角形！");
		return;
	}
	s =0.5*(a+b+c);  // ok
	area = sqrt(s*(s-a)*(s-b)*(s-c));
	printf("a,b,c,s,area = %.2f,%.2f,%.2f,%.2f,%8.3f\n",a,b,c,s,area);
}


void ch3()
{
	printf("======ch3()\n");
	//ch3_1();
	//ch3_2();
    //ch3_3(); 
    ch3_4(); 
	//ch3_5();
	
}
