//#include "stdafx.h"
#include <stdio.h>
#include <math.h>

/********************************************************************
 * ch2,p54, 1. 写出下列各算式的C语言表达式
 ********************************************************************/ 
void ch2_1()
{
     float a,b,c,d,e,x,y;
     
     // (1) 
     y = sin(x)*sin(x)*(a+b)/(a-b);
     
     // (2)
     y = (x>20 && x<30) || x<-100;
     
     // (3)
     y = exp(0.5*x*x)/sqrt(2*3.14);
     
     // (4) 
     y = 0.5*(a*x+(a+x)/(4.0*a));
     
     // (5)
     y = sqrt(pow(sin(x),2.5));
     // 或
     y = pow(sin(x),1.25);
     
     // (6)
     y = x*x-exp(5.0);
     
     // (7)
     y = 3.0*a*e/(c*d); 
     
     // (8)
     y = sqrt(pow(x,y)+log10(y));
     
     // (9)
     y = fabs(pow(x,3.0)+log10(x));
     
     // (10) 对整型变量a取反后右移4位
     unsigned int g = 0x41;
     (~g) >> 4;    
}

/******************************************************************
 * ch2,p55, 2.若有定义：
 * int a=2,b=3;
 * float x=3.5,y=2.5; 
 * 则下列表达式的值是多少？
 *******************************************************************/
void ch2_2()
{
     printf("============ch2_2()\n");
     int a=2,b=3;
     float x=3.5,y=2.5;
     
     // (1)
     printf("(1): %f\n",(float)(a+b)/2+(int)x%(int)y);  // 3.5
     
     // (2) 注，整数/整数的结果是整数，不能把%d写为%f,格式描述符必须与变量类型一致 
     printf("(2): %d\n",(a+b)%2+(int)y/(int)x);  // 1
     
     // (3)
     printf("(3): %d\n",a=(2*a*b)%(b%2));  // 0
}
 
/******************************************************************* 
 * ch2,p55, 3.假设m是一个已知3位数，从左到右用a,b,c表示各位数字，
 *          则由数abc如何求数bac，写出表达式。
 * 答：由数abc(用m表示)，求出: a=m/100,b=m/10%10,c=m%10。
 *     表达式：bac = b*100 + a*10 + c; 
 * while(1)不做要求 
 ********************************************************************/
void ch2_3()
{
	printf("============ch2_3()\n");
	printf("please input 3bit number abc,eg. 123, Ctrl-Z,exit\n");
	int a,b,c,m,bac;
	while (scanf("%d",&m) != EOF) 
	{
		a=m/100;
		b=(m-a*100)/10;
		//b=(m/10)%10;   // ok
		//b=(m%100)/10;  // ok
		//b=m/10%10;     // ok,"/"和"%"运算符优先级同（3），结合方向：自左向右，因此可以不加括号
		//b=m%100/10;    // ok,"/"和"%"运算符优先级同（3），结合方向：自左向右，因此可以不加括号
		c= m%10;
		printf("bac=%d%d%d\n",b,a,c);
		// 或 
		bac=b*100+a*10+c;
		printf("bac=%03d\n",bac); // 注意格式%03d, 不够三位左端用零填充，例如，输入100，显示001 
	}
}

/*******************************************************************
 * ch2,p55, 4. 下列程序执行的结果是什么？
 *******************************************************************/
void ch2_4()
{
     printf("============ch2_4()\n");
     int a = 1;
     char c = 'a'; 
     float f = 2.0;
     printf("(1):%d\n",a+2!=c-100);       // 1
     printf("(2):%d\n",(a>c)>=(f>4));     // 1
     printf("(3):%d\n",(!a&&1)!=(!c||1)); // 1
     printf("(4):%d\n",(!(a>2)?3:0<(f!=1)?0:1)); // 3
     printf("(5):%d\n",(1,2,3)==(3,3,3));        // 1
     printf("(6):%d\n",(c=='A')?(0,1):(1,0));    // 0
     printf("(7):%d\n",(!(a==0),f!=0&&c=='A'));  // 0
     printf("(8):%d\n",c>>(a+3));  // 6
} 

/*************************************************************
  ch2,p55,5.写出一个表达式，如果变量C是大写字母，则将C转换为小写字母，否则C的值不变。
  答：表达式：C = 'A'<=C && C<='Z'?C+32:C 
  while(1)不做要求 
**************************************************************/
void ch2_5()
{
    printf("============ch2_5()\n");
	char C;
	while(1) {
	   printf("请键入任意一个字母，如果是大写将变为小写。输入0，结束。\n");
       //scanf("%c", &C);  // 注意，scanf(),getchar()要等待回车才接收字符，导致下一个循环读取一个'\n',而不是新输入的字符。 
       //C=getchar();
       C=getche();
       if (C=='0') break;
       C = 'A'<=C && C<='Z'?C+32:C;
       printf("\n转换后的字母：%c\n",C);
	   //printf("\n转换后的字母：%c\n",'A'<=C && C<='Z'?C+32:C); //ok
    }
}


void ch2()
{
	printf("==========ch2()\n");
	
	//ch2_2();
	ch2_3();
	//ch2_4();
	//ch2_5();
}
