#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>
/**********************
 * 3. 程序填空题
 **********************/ 
 
 ////////////////// A3_1 ///////////////////////
 /***************************************************
  ch7,156, 9. 编写函数，根据整型参数m的值，计算公式：
     t=1-1/(2*2)-1/(3*3)-...-1/(m*m)
 的值。例如：m=5,则输出0.536389
 ***************************************************/
double ch7_9(int m)
{
	printf("double ch7_9(int m), m=5,则输出0.536389。\n");
	double t=1.0;
	int i;
	
	for(i=2;i<=m;i++) 
	{
		t-=1.0/(i*i); // 注意，必须是1.0 
	}
	return (t);
}

////////////////// A3_2 ///////////////////////
/************************************************
 * ch5, p107, 11. 用迭代法求x=sqrt(a).求平方根的迭代公式为
 *                Xn+1 = (Xn+a/Xn)/2,
 *          要求前后两次求出的x的差的绝对值小于10的-5次方。 
 *************************************************/ 
 void ch5_11()
{
    printf("ch5_11(),迭代法求a的平方根.\n");
    float x0,x,a;
    printf("请输入a\n");
    scanf("%f",&a);   // 填空 
    x = a; // 0 < 初值x0 < a  
    do{
        x0 = x;  
        x = (x0+a/x0)/2;
    }while(fabs(x-x0) >= 1E-5);  // 填空 
    printf("%.2f的平方根=%f,迭代求得: %f\n",a,sqrt(a),x);
}

////////////////// A3_3 ///////////////////////
/********************************** 
 * 冒泡排序函数 
 * 输入a数组，返回排序后的数组
 * N：数组元素个数，
 * ASC: 1,小->大,升序;  0, 大->小,降序 
 ***********************************/
void order(int a[],int N,int ASC)
{      
    int i,j,t;
	int flag=0; // 0:需要继续下一趟比较，1：不需下一趟比较
	
	printf("待排序数据：");
	for (i=0;i<N;i++) { printf("%4d",a[i]); } printf("\n");

	for (j=1;j<=N-1;j++){   // N-1趟排序 
		flag = 1;
		for (i=0;i<N-j;i++) {  // 相邻元素两两比较
            if ((ASC==1 && a[i]>a[i+1]) || (ASC==0 && a[i]<a[i+1])) { // 由小到大排序(升序)或由大到小排序(降序) 
				t=a[i];
				a[i]=a[i+1];
				a[i+1]=t;
				flag = 0;
			}
		}
		if (flag == 1) { printf("不需下一趟比较了!!\n"); break;  } // 不需下一趟比较了 
	}
	
	printf("排序后：");
	for (i=0;i<N;i++) { printf("%4d",a[i]); } printf("\n");	
 }

 ////////////////// A3_4 ///////////////////////
 // 以下函数的功能是：借助指针变量找出数组元素中的最小值及其元素的下标值，请填空。
 void A3_4(int a[],int n) // 题目中采取主函数的形式 
 {
      int *p,*s;  // s指向最小元素
      //for(p=a;p-a<n;p++) scanf("%d",p);  // 第一空 
      for(p=a,s=a;p-a<n;p++)
        if(*p < *s) s=p;  // 第二空 
          printf("最小值=%d,下标=%d\n",*s,s-a); // 第三、四空 
 } 
 
 ////////////////// A3_5 ///////////////////////
 // 以下函数的功能是实现整数参数m的逆序输出，例如m=1234，逆序输出为4321，请填空。 
 void reverse(int m)
 {    
    if (m<0) { putchar('-'); m=-m; } // 处理负数 
    putchar(m%10+'0'); // 第一个空puterchar参数 
    if (m >= 0 && m <=9) return; // 如果是一位数了，终止递归 
    else reverse(m/10);   
 } 
 
 
 //////////////// B3_1
 
 /**********************************
 下面程序的功能是计算：1+1/3+1/5+...+1/51，请填空。 
 **********************************/
void ch5_1()
{
	int i,n;
	float sum = 0; 
    for(i=1; i<=n; i+=2)  // 第一个空
    {
        sum += 1.0/i;  // 注意1.0/i,而不是1/i ，第二个空  
    } 
    printf("sum=%f\n",sum);  
} 

// 下列程序是将字符串str的内容颠倒存放
void B3_2( )
{  int i,j; char c,str[]="1234567" ;
   for(i=0,j=strlen(str)-1; i<j; i++,j--)     // 第3个空,j--
     {  c=str[i]; str[i]=str[j];  str[j]=c; }        // 第4个空
   // 验证
   puts(str); 
}

//////////////// B3_4
//以下程序调用insert函数把x中的值插入到a数组下标为k的数组元素中。主函数中，n存放a数组中数据个数。请填空。
 void insert(int a[],int *n,int k,int x)
 {
      int i;
      for(i=*n-1;i>=k;i--) a[i+1]=a[i];  // 第6个空i+1 
      a[k]=x;
      *n=*n+1;  // 第7个空 1 
 } 
 void B3_4()
 {
      int a[10] = {1,2,3,4,5};
      int i,n=5,x=0,k=2;
      insert(a,&n,k,x);   
      for(i=0;i<n;i++) printf("%4d",a[i]);
      printf("\n"); 
 } 
  
 void completion()
 {
      
      printf("A3_1==========\n");
      printf("%lf\n",ch7_9(5));
      
      printf("A3_2==========\n");
      ch5_11();
      
      printf("A3_3==========\n");
      {
        int a[]={10,70,30,40};
        order(a,4,1);
        order(a,4,0);
      }
      
      printf("A3_4==========\n");
      {
        int a[]={90,70,30,40};
        A3_4(a,4);  // 最小值=30,下标=2
      }
      
      printf("A3_5==========\n");
      reverse(-123456); 
      printf("\n");
      
      printf("B3_2==========\n");
      B3_2();
      
      printf("B3_4==========\n");
      B3_4();
     
 } 
